# BuiltInFailures.FilledRegionFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FilledRegionFailures Class
BuiltInFailures Class Members See Also
---
Failures about FilledRegion.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class FilledRegionFailures
```

Visual Basic
---
```text
Public NotInheritable Class FilledRegionFailures
```

Visual C++
---
```text
public ref class FilledRegionFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..FilledRegionFailures
# See Also
BuiltInFailures..::..FilledRegionFailures Members
Autodesk.Revit.DB Namespace